[{"link":"http://www.luxoft.com/careers/73399/senior-java-developer/","title":"Senior Java Developer","description":"The Customer is one of biggest mobile operators in the Ukraine. The project is the development and support of specialized customer relationship system used for telecom business. The CRM system is written in Java and integrated with numerous supplemental systems such as billing, search, business process management and such. ● Implement the right technologies and platforms in order to push forward the product, and yet, leave it user-friendly and straightforward; ● Learn new things and share new ideas with the browser team; ● Make sure that a code you develop is accurate, clear and cross-platform; ● Be both, a good independent developer and a team player; ● Closely work with the rest team and share your working experience. ● More than 4 years in Java Software Development. ● Java (JSP, Servlets, SOAP/RESTful, Spring, JDBC/ORM, Threads) ● integration frameworks (Camel, Spring) ● project lifecycle management systems (maven, ivy, Jenkins etc) ● JavaScript + framework (jQuery, AngularJS), ● Relational databases ● Understanding use cases & functional specifications. ● Coordinating with co-developers. ● Ability to discern user requirements and develop specifications. ● Strong sense of purpose and urgency is a must.","dateOfPublication":"Dec 29, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"There is no working experience needed!!"},{"link":"http://www.luxoft.com/careers/69387/senior-java-developer/","title":"Senior Java Developer","description":"UI Web application that provides financial data for customers on demand. Person should be able to analyze the existing framework, propose and discuss the architectural and technology solutions, provide proper level of development, System/Unit testing, QA/UAT support. Should be a good team player to be able to work in Agile environment. Regular Front End developer:","dateOfPublication":"Dec 29, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Javascript, JQuery must have"},{"link":"http://www.luxoft.com/careers/75522/regular-java-developer-with-xslt-skillset/","title":"Regular Java Developer (with XSLT skillset)","description":"We are pleased to announce new vacancy opening in the Luxoft Media department. Our department runs a variety of small, medium and large accounts in multiple domains internationally, like Mass Media, Social Networks, Video streaming, Mobile communications, offering versatile and challenging opportunities for those who seek continuous professional development within very strong teams. In Media we are striving to employ cutting edge technologies and approaches whenever possible. Most of our Customers come from the USA, UK, Australia, Japan and Western Europe, hence satisfactory English command is a must. Our Customer is among the world's leading creators and distributors of award-winning still imagery, video and multimedia products, as well as other forms of premium digital content, available through its trusted house of brands, including Image.net©, iStock© and others. The project targets to enhance and further develop advanced media management platform, to help our Customer to serve business customers in more than 100 countries and continue to be the first place media professionals to discover, purchase and manage the digital content. You will have an opportunity to work alongside of the best-in-class photographers and imagery (business trips to Seattle, USA are planned) that help customers produce inspiring work which appears every day in the world's most influential newspapers, magazines, advertising campaigns, films, television programs, books and online media.","dateOfPublication":"Dec 28, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"2+ years of work experience with Java"},{"link":"http://www.luxoft.com/careers/75435/senior-strong-regular-java-developer/","title":"Senior/Strong Regular Java Developer","description":"The project is the core data sourcing, processing, classification, stewardship and persistence platform for departments of one of the biggest Investment Bank. Software Development for finance; Work in a Scrum team; Deep understanding of Core Java (Collections, multithreading, exception handling) 5+ Extensive experience in web application development 5+ OOP, OOD design patterns; 3+ Knowledge of following technologies: Unit testing Experience working in Scrum team Problem solving skills Good knowledge of SQL 3+","dateOfPublication":"Dec 24, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Spring (MVC, core)"},{"link":"http://www.luxoft.com/careers/75355/java-team-lead-senior-developer-rcp/","title":"Java Team Lead/Senior Developer (RCP)","description":"Developed product is the leading software system in Energy domain covering all aspects of Oil&Gas production from geological exploration to optimization of ongoing production. Our technology solution helps geologists and geophysicists to research, visualize and interpret large volumes of geological data. Leading and supervising other developers and testers in the team (up to 6) Day-to-day communication with customer Application design Hands-on software development Good communication and leadership skills Upper-Intermediate English 2+ years as team lead or manager (for Lead level) 5+ years in Java development Good experience in desktop applications development using Java Experience with Eclipse RCP and SWT","dateOfPublication":"Dec 23, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"There is no working experience needed!!"},{"link":"http://www.luxoft.com/careers/75353/senior-java-developer/","title":"Senior Java Developer","description":"We are pleased to announce new vacancy opening in the Luxoft Media department. Our department runs a variety of small, medium and large accounts in multiple domains internationally, like Mass Media, Social Networks, Video streaming, Mobile communications, offering versatile and challenging opportunities for those who seek continuous professional development within very strong teams. In Media we are striving to employ cutting edge technologies and approaches whenever possible. Most of our Customers come from the USA, UK, Australia, Japan and Western Europe, hence satisfactory English command is a must. Our Customer is among the world's leading creators and distributors of award-winning still imagery, video and multimedia products, as well as other forms of premium digital content, available through its trusted house of brands, including Image.net©, iStock© and others. The project targets to enhance and further develop advanced media management platform, to help our Customer to serve business customers in more than 100 countries and continue to be the first place media professionals to discover, purchase and manage the digital content. You will have an opportunity to work alongside of the best-in-class photographers and imagery (business trips to Seattle, USA are planned) that help customers produce inspiring work which appears every day in the world's most influential newspapers, magazines, advertising campaigns, films, television programs, books and online media.","dateOfPublication":"Dec 23, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"5+ years of work experience with Java"},{"link":"http://www.luxoft.com/careers/71967/senior-java-developer/","title":"Senior Java developer","description":"Audit management system This is a bank wide application that will be used to plan and track progress of internal and external audits performed in the bank as well as issues found during audits as well as supporting the workflows of the departments involved. The primary goal is to track the issues and their resolution plans, helping users to track and coordinate issues resolution. The application needs to generate reports for senior management enabling them to understand the status for the audits and issues resolution across the bank. The system is deployed across 80 countries and used in tens of different departments with a global user base of up to 6000 users. Provide expert competence within enterprise front end development area: General day to day activities must ensure a successful delivery and a seamless functioning of the project team. Participate and drive architectural discussions. Participate in coaching junior developers. Technical skills: JUnit Tools and Frameworks Maven Databases (at Oracle & MS SQL a must,). Deep understanding web development technologies - HTML, CSS, JS. HTTP/HTTPS protocols and balancing technics and it's standard usage patterns in enterprise environments Development tools - build servers, version control systems, build systems Team City Good knowledge of Linux / Unix Soft skills:","dateOfPublication":"Dec 22, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Java Core and Enterprise technologies and standards,"},{"link":"http://www.luxoft.com/careers/72866/alstom-settlement-senior-java-developer/","title":"Alstom Settlement Senior Java Developer","description":"A project of Electricity Market System, for the Dutch transmission system operator allowing to receive some regulation offers from market participants, select them based on economic and security constraints and prepare market participant invoicing. Major international project in the Energy electricity market in Europe nowadays.","dateOfPublication":"Nov 18, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"advanced spoken and written English"},{"link":"http://www.luxoft.com/careers/72361/middle-java-developer-fox/","title":"Middle Java Developer_FOX","description":"UI Web application that provides possibility to configure and administer internal applications of client. Person should be able to analyze the existing framework, propose and discuss the architectural and technology solutions, provide proper level of development, System/Unit testing, QA/UAT support. Should be a good team player to be able to work in Agile environment. The application should look simple, be UI/UX optimized. Additional Skills / Knowledge (optional)","dateOfPublication":"Nov 9, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Java core, OOP/OOD knowledge, design patterns;"},{"link":"http://www.luxoft.com/careers/71800/senior-java-developer-sita/","title":"Senior Java Developer (SITA)","description":"Development and maintenance of the Mobile Suite Application which provides Web Check-in and Booking services for airline companies. The application supports different type of connectors including Web browser and REST Web Service API should be able to understand js. Mandatory: Optional: AXIS2, CXF, RESTful Architecture, JAXB, Hazelcast, Hibernate, EasyMock, Mokito, JSF, JQuery, HTML5","dateOfPublication":"Nov 3, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Spring IoC/MVC/Security"},{"link":"http://www.luxoft.com/careers/70931/senior-gwt-java-developer/","title":"Senior GWT/Java Developer","description":"This is web application to observe/delegate responsibilities to company employees. It is used by bank institutions in compliance with European Union legal regulations. Horizon is a bank wide management information system aimed to show key risk and compliance figures in a single, user-friendly and intuitive manner using a user experience driven approach. The сlient has plans for future project development, so we need one more team to add to the project. Why bother? Let's jump behind the usual stuff, like big salary, table tennis etc. The people you will work on daily basis are equally important: You see we have a cool team here. What we don't have is a cool developer to work with us. So if you feel qualified and you would like to work with such a team - just read bellow. The main used technology is Google Web Toolkit (GWT) with Oracle database behind. Spring and Hibernate are in the middle. The build process is Maven-based. Our application has modular architecture (OSGI) and its core is the Horizon platform. The platform itself is developed internally, and it provides the most common UI components. You have to have experience in:","dateOfPublication":"Oct 22, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"GWT"},{"link":"http://www.luxoft.com/careers/70218/senior-java-front-end-developer/","title":"Senior Java Front End Developer","description":"UI Web application that provides financial data for customers on demand. Person should be able to analyze the existing framework, propose and discuss the architectural and technology solutions, provide proper level of development, System/Unit testing, QA/UAT support. Should be a good team player to be able to work in Agile environment.","dateOfPublication":"Oct 9, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Java SE must have"},{"link":"http://www.luxoft.com/careers/70063/regular-senior-java-developer-kiev/","title":"Regular+/Senior Java Developer - Kiev","description":"Our program was started as the migration of the Clearing and Settlement legacy mainframe system to a new technical, highly-scalable platform. The success of the program in both the migration and creation of a scalable platform led to it being selected as the strategic Clearing and Settlement platform for the bank. This has led to significant further investment for legacy system migrations and technical improvements. Currently we have teams across several locations (London, Kiev, Hong Kong, Sydney) on those projects. Mature technical and process practices In our daily work we follow the best Agile/Scrum values and practices. Our main goal is to produce high-quality technical solutions which meet expectations of our end users. We achieve it by working directly with business representatives, continuous focus on maximizing business value, monthly releases and 2-week Sprints, resulting to completed potentially shippable product increment. Self-organized teams Delivery is done by self-organized cross-functional feature teams; each of them consists of a Business Analyst and 5 developers who sit together in the same room and interact on a daily basis. Each team responsible for end-to-end, starting from high-level requirements clarification and finishing by release build preparation. Ability to grow technically and professionally We aim to hire the best people and give them maximum autonomy for realizing their potential and growing technically/professionally. Competence, collaboration and continuous improvement are highly supported on program level, to create a culture where each individual can grow in their desired direction. Also there is agreement with our customers about spending 10% of everybody's time for non-delivery activities (as a contribution to the greater good of the platform and department) - some people use it as opportunity for collective learning new technologies and practices (like Scala, Clean Code etc) in order to prove and adopt them on project level. Our working model provides opportunity for everybody to take part in making technical/architectural decisions. Regular Business Trips Regular business trips to London and Krakow allow people to improve their English level, also create opportunities for knowledge sharing with high-skilled technical and business experts on customer side and their colleagues. No Manual Testing We don't hire manual testers in teams and we don't have manual testing as separate development stage. In daily work we automate as much as possible. We are disciplined when write code, follow pair-programming and TDD practices, use several levels of testing (unit, integration and functional). This allow us to keep quality at a high level, have frequent releases, get continuous feedback after each commit, reduce amount of bugs and don't have post-release support phase. Technology Stack Our system can handle the increasing trade volume due to its enhanced scalability, can respond quickly to market and regulatory changes due to it's supportability. Our key principle is regular evaluation of new technologies and adoption where a benefit can be shown. Currently we use Java, Spring, Hibernate, Drools, IBM MQ, Oracle, Groovy/Grails, GWT for development, Maven and Gradle as build tools. For writing automated tests we use JUnit, EasyB, Cucumber, Mockito/EasyMock. Also we have our own framework for functional testing which will be soon replaced by Concordion and JBehave. In future we plan to use GigaSpaces, HTLM5/JavaScript for GUI side and Scala. Mandatory: Nice to have:","dateOfPublication":"Oct 7, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"3+ years in IT Industry"},{"link":"http://www.luxoft.com/careers/70059/regular-senior-java-developer-kiev/","title":"Regular+/Senior Java Developer - Kiev","description":"Our program was started as the migration of the Clearing and Settlement legacy mainframe system to a new technical, highly-scalable platform. The success of the program in both the migration and creation of a scalable platform led to it being selected as the strategic Clearing and Settlement platform for the bank. This has led to significant further investment for legacy system migrations and technical improvements. Currently we have teams across several locations (London, Kiev, Hong Kong, Sydney) on those projects. Mature technical and process practices In our daily work we follow the best Agile/Scrum values and practices. Our main goal is to produce high-quality technical solutions which meet expectations of our end users. We achieve it by working directly with business representatives, continuous focus on maximizing business value, monthly releases and 2-week Sprints, resulting to completed potentially shippable product increment. Self-organized teams Delivery is done by self-organized cross-functional feature teams; each of them consists of a Business Analyst and 5 developers who sit together in the same room and interact on a daily basis. Each team responsible for end-to-end, starting from high-level requirements clarification and finishing by release build preparation. Ability to grow technically and professionally We aim to hire the best people and give them maximum autonomy for realizing their potential and growing technically/professionally. Competence, collaboration and continuous improvement are highly supported on program level, to create a culture where each individual can grow in their desired direction. Also there is agreement with our customers about spending 10% of everybody's time for non-delivery activities (as a contribution to the greater good of the platform and department) - some people use it as opportunity for collective learning new technologies and practices (like Scala, Clean Code etc) in order to prove and adopt them on project level. Our working model provides opportunity for everybody to take part in making technical/architectural decisions. Regular Business Trips Regular business trips to London and Krakow allow people to improve their English level, also create opportunities for knowledge sharing with high-skilled technical and business experts on customer side and their colleagues. No Manual Testing We don't hire manual testers in teams and we don't have manual testing as separate development stage. In daily work we automate as much as possible. We are disciplined when write code, follow pair-programming and TDD practices, use several levels of testing (unit, integration and functional). This allow us to keep quality at a high level, have frequent releases, get continuous feedback after each commit, reduce amount of bugs and don't have post-release support phase. Technology Stack Our system can handle the increasing trade volume due to its enhanced scalability, can respond quickly to market and regulatory changes due to it's supportability. Our key principle is regular evaluation of new technologies and adoption where a benefit can be shown. Currently we use Java, Spring, Hibernate, Drools, IBM MQ, Oracle, Groovy/Grails, GWT for development, Maven and Gradle as build tools. For writing automated tests we use JUnit, EasyB, Cucumber, Mockito/EasyMock. Also we have our own framework for functional testing which will be soon replaced by Concordion and JBehave. In future we plan to use GigaSpaces, HTLM5/JavaScript for GUI side and Scala. Mandatory: Nice to have:","dateOfPublication":"Oct 7, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"3+ years in IT Industry"},{"link":"http://www.luxoft.com/careers/66957/middle-java-developer/","title":"Middle Java Developer","description":"UI Web application that provides financial data for customers on demand. Person should be able to analyze the existing framework, propose and discuss the architectural and technology solutions, provide proper level of development, System/Unit testing, QA/UAT support. Should be a good team player to be able to work in Agile environment. Additional Skills / Knowledge (optional)","dateOfPublication":"Oct 2, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"Java core, OOP/OOD knowledge, design patterns;"},{"link":"http://www.luxoft.com/careers/64202/regular-senior-java-developer/","title":"Regular+/Senior Java Developer","description":"Our program was started as the migration of the Clearing and Settlement legacy mainframe system to a new technical, highly-scalable platform. The success of the program in both the migration and creation of a scalable platform led to it being selected as the strategic Clearing and Settlement platform for the bank. This has led to significant further investment for legacy system migrations and technical improvements. Currently we have teams across several locations (London, Kiev, Hong Kong, Sydney) on those projects. Mature technical and process practices In our daily work we follow the best Agile/Scrum values and practices. Our main goal is to produce high-quality technical solutions which meet expectations of our end users. We achieve it by working directly with business representatives, continuous focus on maximizing business value, monthly releases and 2-week Sprints, resulting to completed potentially shippable product increment. Self-organized teams Delivery is done by self-organized cross-functional feature teams; each of them consists of a Business Analyst and 5 developers who sit together in the same room and interact on a daily basis. Each team responsible for end-to-end, starting from high-level requirements clarification and finishing by release build preparation. Ability to grow technically and professionally We aim to hire the best people and give them maximum autonomy for realizing their potential and growing technically/professionally. Competence, collaboration and continuous improvement are highly supported on program level, to create a culture where each individual can grow in their desired direction. Also there is agreement with our customers about spending 10% of everybody's time for non-delivery activities (as a contribution to the greater good of the platform and department) - some people use it as opportunity for collective learning new technologies and practices (like Scala, Clean Code etc) in order to prove and adopt them on project level. Our working model provides opportunity for everybody to take part in making technical/architectural decisions. Regular Business Trips Regular business trips to London and Krakow allow people to improve their English level, also create opportunities for knowledge sharing with high-skilled technical and business experts on customer side and their colleagues. No Manual Testing We don't hire manual testers in teams and we don't have manual testing as separate development stage. In daily work we automate as much as possible. We are disciplined when write code, follow pair-programming and TDD practices, use several levels of testing (unit, integration and functional). This allow us to keep quality at a high level, have frequent releases, get continuous feedback after each commit, reduce amount of bugs and don't have post-release support phase. Technology Stack Our system can handle the increasing trade volume due to its enhanced scalability, can respond quickly to market and regulatory changes due to it's supportability. Our key principle is regular evaluation of new technologies and adoption where a benefit can be shown. Currently we use Java, Spring, Hibernate, Drools, IBM MQ, Oracle, Groovy/Grails, GWT for development, Maven and Gradle as build tools. For writing automated tests we use JUnit, EasyB, Cucumber, Mockito/EasyMock. Also we have our own framework for functional testing which will be soon replaced by Concordion and JBehave. In future we plan to use GigaSpaces, HTLM5/JavaScript for GUI side and Scala. Mandatory: Nice to have:","dateOfPublication":"Jun 18, 2015","companyName":"Luxoft","city":"Kiev","typeOfEmployment":"Full Time","experienceOfWork":"3+ years in IT Industry"}]